DeltaNova/STM32/WS2812/ws2812.cpp
        for (int i=0; i < NUM_LEDS; i=i+3) {
          setPixelRGB( 0,0,0,i+q,pixels);        //turn every third pixel off
        }
    }
  }
}

uint8_t* Wheel(uint8_t WheelPos) {
  static uint8_t c[3];
  if(WheelPos < 85) {
   c[0]=WheelPos * 3;
   c[1]=255 - WheelPos * 3;
   c[2]=0;
  } else if(WheelPos < 170) {
   WheelPos -= 85;
   c[0]=255 - WheelPos * 3;
   c[1]=0;
   c[2]=WheelPos * 3;
  } else {
   WheelPos -= 170;
   c[0]=0;
   c[1]=WheelPos * 3;
   c[2]=255 - WheelPos * 3;
  }
  return c;
}

void meteorRain(uint8_t R, uint8_t G, uint8_t B, uint8_t meteorSize, uint8_t meteorTrailDecay, bool meteorRandomDecay, int SpeedDelay) {  
    setAllRGB(0,0,0,pixels);
    for(int i = 0; i < NUM_LEDS+NUM_LEDS; i++) {
        // fade brightness all LEDs one step
        for(int j=0; j<NUM_LEDS; j++) {
            if( (!meteorRandomDecay) || (getRandomNumber(0,10)>5) ) {
                fadeToBlack(j, meteorTrailDecay );        
            }
        }

        // draw meteor
        for(int j = 0; j < meteorSize; j++) {
            if( ( i-j <NUM_LEDS) && (i-j>=0) ) {
                setPixelRGB(R, G, B, i-j, pixels);
            } 
        }
        writeLED(pixels,NUM_LEDS, DMA_Buffer);
        delay_ms(SpeedDelay);
    }
}


void fadeToBlack(int ledNo, uint8_t fadeValue) {
    // Used by meteorRain()
    uint8_t r, g, b;
    r = pixels[ledNo][0];
    g = pixels[ledNo][2];
    b = pixels[ledNo][1];

    r=(r<=10)? 0 : (int) r-(r*fadeValue/256);
    g=(g<=10)? 0 : (int) g-(g*fadeValue/256);
    b=(b<=10)? 0 : (int) b-(b*fadeValue/256);
    
    setPixelRGB(r,g,b,ledNo,pixels);
}

void RunningLights(uint8_t R, uint8_t G, uint8_t B, uint8_t (&array)[NUM_LEDS][3],  uint16_t WaveDelay) {
    
    // Compile Time Check for global NUM_LED value 
    static_assert(NUM_LEDS > 0, "RunningLights - NUM_LEDS needs to be > 0");
    static_assert(NUM_LEDS <= 255, "RunningLights - NUM_LEDS needs to be <= 255");
    
    uint8_t Position = 0;
    uint16_t j; // j needs to be large enough to hold MAX NUM_LED, 255*2 = 510.
    for(j=0; j<NUM_LEDS*2; j++){
        Position++; // = 0; //Position + Rate;
        for(uint8_t i=0; i<NUM_LEDS; i++) {
            setPixelRGB(((sin(i+Position) * 127 + 128)/255)*R,
                    ((sin(i+Position) * 127 + 128)/255)*G,
                    ((sin(i+Position) * 127 + 128)/255)*B,
                    i,pixels);
        }
        writeLED(pixels,NUM_LEDS,DMA_Buffer);
        delay_ms(WaveDelay);
    }
}

void Strobe(uint8_t R, uint8_t G, uint8_t B, uint8_t StrobeCount, uint16_t FlashDelay, uint16_t EndPause){

  for(int j = 0; j < StrobeCount; j++) {

    setAllRGB(R,G,B,pixels);
    writeLED(pixels,NUM_LEDS, DMA_Buffer);
    delay_ms(FlashDelay);
    setAllRGB(0,0,0,pixels);
    writeLED(pixels,NUM_LEDS, DMA_Buffer);
    delay_ms(FlashDelay);
  }
 delay_ms(EndPause);
}

void Twinkle(uint8_t R, uint8_t G, uint8_t B, uint8_t Count, uint8_t SpeedDelay, bool OnlyOne) {
  setAllRGB(0,0,0,pixels);
  for (uint8_t i=0; i<Count; i++) {
     setPixelRGB(R,G,B,getRandomNumber(0,NUM_LEDS),pixels);
     writeLED(pixels,NUM_LEDS, DMA_Buffer);
     delay_ms(SpeedDelay);
     if(OnlyOne) { 
       setAllRGB(0,0,0,pixels); 
     }
   }
  delay_ms(SpeedDelay);
}

void TwinkleRandom(uint8_t Count, uint8_t SpeedDelay, bool OnlyOne) {
  setAllRGB(0,0,0,pixels);
  for (uint8_t i=0; i<Count; i++) {
     setPixelRGB(getRandomNumber(0,255),getRandomNumber(0,255),getRandomNumber(0,255),getRandomNumber(0,NUM_LEDS),pixels);
     writeLED(pixels,NUM_LEDS, DMA_Buffer);
     delay_ms(SpeedDelay);
     if(OnlyOne) { 
       setAllRGB(0,0,0,pixels); 
     }
   }
  delay_ms(SpeedDelay);
}
*/
    



void setPixel(uint8_t colour[3], uint8_t pixel, uint8_t (&array)[NUM_LEDS][3]){
    // pixel is the LED position in the string
    // colour is an array of R,G,B values
    // array is the array which holds the data for all the pixels in the string.
    array[pixel][0] = colour[0];
    array[pixel][1] = colour[1];
    array[pixel][2] = colour[2];
    }

void setPixelRGB(uint8_t R, uint8_t G, uint8_t B, uint8_t pixel, uint8_t (&array)[NUM_LEDS][3]){
    // pixel is the LED position in the string
    // R,G,B are individual colour values.
    // array is the array which holds the data for all the pixels in the string.
    array[pixel][0] = R;
    array[pixel][1] = G;
    array[pixel][2] = B;
    }

void setAll(uint8_t colour[3], uint8_t (&array)[NUM_LEDS][3]){
    // R,G,B are individual colour values.
    // array is the array which holds the data for all the pixels in the string.
    for (uint8_t i = 0; i < NUM_LEDS; i++){
            array[i][0] = colour[0];
            array[i][1] = colour[1];
            array[i][2] = colour[2];   
    }
}


void DMA_Setup(){
    // DMA Setup - DMA1 Channel 5 for use with TIM2 Channel 1
    RCC->AHBENR |= 0x00000001; // Enable DMA 1 Clock
    
    // DMA Channel 5 Configuration
    // Load base address of peripheral register to which data will be written.
    // Load the address of the compare register converting from 16 to 32 bits
    DMA1_Channel5->CPAR = (uint32_t)(&(TIM2->CCR1));
    
    // Load the memory address data will be read from
    //DMA1_Channel5->CMAR = (uint32_t)pwm_array;
    DMA1_Channel5->CMAR = (uint32_t)DMA_Buffer;
    
    // Load the number of data transfers.
    // Circular mode will be used to loop over the two values in the array
    // so only to values need to be transferred before everyting resets.
    //DMA1_Channel5->CNDTR = 2;
    
    // Configure Channel Priority
    // Leaving at default 'Low' priority
    //DMA-CCR5 |= 0x00000000; 
    
    // Configure additional channel features
    //  Memory Size 8 bits
    //  Peripheral Size 16 bits
    //  Memory Increment Mode Enabled
    //  Circular Mode Enabled
    //  Direction: Read From Memory
    //  HT Interrupt: Enabled
    //  TC Interrupt: Enabled
    DMA1_Channel5->CCR |= 0x000001B6;
    
    NVIC_ClearPendingIRQ(DMA1_Channel5_IRQn);    // Clear Pending Status
    NVIC_EnableIRQ(DMA1_Channel5_IRQn);          // Enable Interrupt
        
